<template>
  <div class="text-brand-100">
    <div class="main-wrapper flex justify-center items-center bg-brand-300">
      <Nuxt />
    </div>
    <div class="hidden">
      <img :src="require(`~/assets/image.png`)" />
    </div>
    <div
      class="div py-3 bg-gray-700 text-brand-100 justify-center flex-col flex"
    >
      <div class="flex justify-center items-center gap-x-8 mb-3">
        <a
          href="https://github.com/nemo369/dine-with-me"
          target="_blank"
          rel="noopener noreferrer"
          class="block w-10"
        >
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 448 512">
            <path
              d="M400 32H48C21.5 32 0 53.5 0 80v352c0 26.5 21.5 48 48 48h352c26.5 0 48-21.5 48-48V80c0-26.5-21.5-48-48-48zM277.3 415.7c-8.4 1.5-11.5-3.7-11.5-8 0-5.4.2-33 .2-55.3 0-15.6-5.2-25.5-11.3-30.7 37-4.1 76-9.2 76-73.1 0-18.2-6.5-27.3-17.1-39 1.7-4.3 7.4-22-1.7-45-13.9-4.3-45.7 17.9-45.7 17.9-13.2-3.7-27.5-5.6-41.6-5.6-14.1 0-28.4 1.9-41.6 5.6 0 0-31.8-22.2-45.7-17.9-9.1 22.9-3.5 40.6-1.7 45-10.6 11.7-15.6 20.8-15.6 39 0 63.6 37.3 69 74.3 73.1-4.8 4.3-9.1 11.7-10.6 22.3-9.5 4.3-33.8 11.7-48.3-13.9-9.1-15.8-25.5-17.1-25.5-17.1-16.2-.2-1.1 10.2-1.1 10.2 10.8 5 18.4 24.2 18.4 24.2 9.7 29.7 56.1 19.7 56.1 19.7 0 13.9.2 36.5.2 40.6 0 4.3-3 9.5-11.5 8-66-22.1-112.2-84.9-112.2-158.3 0-91.8 70.2-161.5 162-161.5S388 165.6 388 257.4c.1 73.4-44.7 136.3-110.7 158.3zm-98.1-61.1c-1.9.4-3.7-.4-3.9-1.7-.2-1.5 1.1-2.8 3-3.2 1.9-.2 3.7.6 3.9 1.9.3 1.3-1 2.6-3 3zm-9.5-.9c0 1.3-1.5 2.4-3.5 2.4-2.2.2-3.7-.9-3.7-2.4 0-1.3 1.5-2.4 3.5-2.4 1.9-.2 3.7.9 3.7 2.4zm-13.7-1.1c-.4 1.3-2.4 1.9-4.1 1.3-1.9-.4-3.2-1.9-2.8-3.2.4-1.3 2.4-1.9 4.1-1.5 2 .6 3.3 2.1 2.8 3.4zm-12.3-5.4c-.9 1.1-2.8.9-4.3-.6-1.5-1.3-1.9-3.2-.9-4.1.9-1.1 2.8-.9 4.3.6 1.3 1.3 1.8 3.3.9 4.1zm-9.1-9.1c-.9.6-2.6 0-3.7-1.5s-1.1-3.2 0-3.9c1.1-.9 2.8-.2 3.7 1.3 1.1 1.5 1.1 3.3 0 4.1zm-6.5-9.7c-.9.9-2.4.4-3.5-.6-1.1-1.3-1.3-2.8-.4-3.5.9-.9 2.4-.4 3.5.6 1.1 1.3 1.3 2.8.4 3.5zm-6.7-7.4c-.4.9-1.7 1.1-2.8.4-1.3-.6-1.9-1.7-1.5-2.6.4-.6 1.5-.9 2.8-.4 1.3.7 1.9 1.8 1.5 2.6z"
            />
          </svg>
        </a>
        <a
          class="block nemo-logo logo"
          href="https://naamanfrenkel.dev/"
          target="_blank"
          rel="noopener noreferrer"
        >
          <svg
            id="Layer_1"
            height="60"
            xmlns="http://www.w3.org/2000/svg"
            viewBox="-395 273.3 50 50"
          >
            <path
              id="fire"
              class="st0"
              d="M-380.6 308.8c2.2 2.1 2.2 5.7 0 7.8-2.2 2.1-8.9 4.9-11.1 2.8s.7-8.5 2.9-10.6c2.3-2.1 5.9-2.1 8.2 0z"
            ></path>
            <path
              id="Lines"
              class="st0"
              d="M-380.9 309c-.1.2-.1.3-.3.5-1.4 1.3-2.8 2.7-4.2 4-1 1-2 1.9-3 2.9-.8.7-1.5 1.4-2.3 2.1-.2.2-.5.2-.7 0-.2-.2-.2-.5.1-.7 2.1-2 4.2-4 6.3-6.1 1.1-1 2.1-2 3.2-3 .1-.1.4-.1.5-.1.2.1.3.3.4.4zm1.6 1.9c.2.1.4.2.5.3.2.2.1.5-.1.6-.6.5-1.1 1.1-1.7 1.6-1.7 1.6-3.4 3.3-5.1 4.9-.3.3-.5.3-.7.1-.2-.2-.2-.5.1-.8 1.1-1 2.2-2.1 3.3-3.1 1.2-1.1 2.3-2.2 3.5-3.3-.2-.1 0-.2.2-.3zm-4.3-4.6c.1.1.3.1.4.3.2.2.1.4-.1.6l-1 1c-1.8 1.7-3.5 3.4-5.3 5-.2.2-.5.4-.7.6-.3.2-.5.2-.7 0-.2-.2-.2-.5.1-.7.6-.6 1.2-1.1 1.8-1.7 1.1-1 2.1-2 3.2-3 .6-.6 1.3-1.2 1.9-1.8.1-.1.2-.2.4-.3z"
            ></path>
            <g id="rocket">
              <path
                id="Path_1_"
                class="st1"
                d="M-367.7 296c6.7 6.7 8 16.2 1.7 22.5l-3 3c-6.3 6.3-2-8.9-8.6-15.5s-21.9-2.3-15.5-8.6l3-3c6.3-6.4 15.7-5.1 22.4 1.6z"
              ></path>
              <path
                id="Path_2_"
                class="st1"
                d="M-346 274.3c1 .9 1.3 4.3 0 8.8-1.4 5.1-4.7 11.6-11.3 18-8.1 7.9-13.2 10.7-13.2 10.7-5.4 3.6-8 1.1-11.4-2.2-3.4-3.4-6-5.9-2.3-11.3 0 0 2.9-5.1 10.9-13 6.2-6.1 12.5-9.4 17.5-10.9 5-1.4 8.7-1.1 9.8-.1z"
              ></path>
              <path
                id="Path_3_"
                class="st2"
                d="M-359 286.7c1.9 1.9 1.9 5.1 0 7-1.9 1.9-5.1 1.9-7 0-1.9-1.9-1.9-5.1 0-7 1.9-1.9 5.1-1.9 7 0z"
              ></path>
              <path
                id="Path_4_"
                class="st2"
                d="M-371.1 298.5c1 .9-.9 4.3-5.7 8.8-4.8 4.6-7.7 5.8-8.6 4.8-1-.9.3-3.7 5-8.3 4.8-4.4 8.3-6.2 9.3-5.3z"
              ></path>
            </g></svg
        ></a>
      </div>

      <small class="block text-sm max-w-md mx-auto text-brand-100 px-3 md:px-0">
        בואו לאכול איתי עונת הסטטיסטיקות הוא אתר מעריצים לסדרת הקאלט. לאתר אין
        קשר ליוצרי ומפיקי התוכנית (כולל כאן 11 וגיל הפקות) אם נפלה טעות בנתונים
        או נפגעו זכויות יוצרים אשמח שתיידעו אותי על מנת שאוכל לתקן בהקדם.
      </small>
    </div>
  </div>
</template>

<style scoped>
.nemo-logo {
  transition: transform 0.5s;
  transition-delay: 0.3s;
  transform-origin: 70px 17px;
}
.nemo-logo:hover {
  transform: rotate(-45deg) translateY(-50%);
}
.nemo-logo:hover #fire {
  opacity: 0;
  transform: translateY(-10%);
}
@keyframes rotate {
  100% {
    transform: rotate(-45deg);
  }
}
@keyframes bounce {
  0% {
    transform: translate3d(0px, 0px, 0);
  }
  50% {
    transform: translate3d(0px, -4px, 0);
  }
  100% {
    transform: translate3d(0px, 0px, 0);
  }
}
@keyframes fumes2 {
  50% {
    transform: scale(1.1);
  }
}
.logo .st0 {
  fill: #cb5858;
}
.logo .st1 {
  fill: #fff;
  stroke: #000;
  stroke-width: 0.25;
  stroke-miterlimit: 10;
}
.logo .st2 {
  fill: #1d1d1d;
}
.logo #fire {
  transition: opacity 0.2s;
}
</style>
